---
kind: property
id: P:Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.FinishedSize
source: html/e1f72113-d1ce-4fc7-39b2-c854563ca6bb.htm
---
# Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.FinishedSize Property

The transferred data size, in bytes, since the last time this event was raised.

## Syntax (C#)
```csharp
public double FinishedSize { get; }
```